const obj = {
    code: 200,
    message: 'ok',
    data: {
        title: '心墙',
        author: '郭静',
        duration: '04:10',
        pic: 'images/center.jpg',
        audio: 'images/1.m4a',
        lyric: "[00:00.00] 作词 : 姚若龙\n[00:01.00] 作曲 : 林俊杰\n[00:02.00] 词SP：ADVANCE FORESIGHT INC先见有限公司\n[00:03.00] 曲SP：北京大石音乐版权有限公司\n[00:04.00] 音乐总监：谷粟@牛班NEWBAND\n[00:05.00] 音响总监：何飚\n[00:06.00] 舞台总监：李柯\n[00:07.00] 音乐监制：陈美威\n[00:08.00] 音乐设计：王皓@WONDERWALL \n[00:09.00] 制作人：汤佩弦@牛班NEWBAND\n[00:10.00] 改编编曲：赖伟哲\n[00:11.00] 混音：林梦洋\n[00:12.00] 乐队总监: 黎明鑫｜阿火 Afire Lee\n[00:13.00] 木吉他：黎明鑫｜阿火 Afire Lee\n[00:14.00] 电吉他：江镇宇\n[00:15.00] 贝斯：林宏宇\n[00:16.00] 键盘：袁伟翔\n[00:17.00] 鼓：胡浈筌\n[00:18.00] 电脑编程：林铂坚Johnny Lin\n[00:19.00] 乐队统筹：王雅玟\n[00:20.00] 音乐执行：许朝钦 Chin Hsu\n[00:21.00] 乐队技师：许朝钦 Chin Hsu\n[00:25.20]一个人 眺望碧海和蓝天\n[00:32.71]在心里面 那抹灰就淡一些\n[00:39.49]海豚从眼前 飞越\n[00:43.16]我看见了最阳光的笑脸\n[00:47.51]好时光都该被宝贝 因为有限\n[00:56.26]我学着不去担心得太远\n[01:00.10]不计划太多 反而能勇敢冒险\n[01:03.74]丰富地过每一天 快乐地看每一天\n[01:11.57]第一次遇见阴天 遮住你侧脸\n[01:15.46]有什么故事好想了解\n[01:19.17]我感觉我懂 你的特别\n[01:25.63]你的心有一道墙 但我发现一扇窗\n[01:34.48]偶尔透出 一丝暖暖的微光\n[01:41.22]就算你有一道墙 我的爱会攀上窗台盛放\n[01:49.13]打开窗你会看到 悲伤融化\n[02:13.53]我学着不去担心得太远\n[02:17.52]不计划太多 反而能勇敢冒险\n[02:21.33]丰富地过每一天 快乐地看每一天\n[02:29.06]第一次遇见阴天 遮住你侧脸\n[02:32.87]有什么故事好想了解\n[02:36.42]我感觉我懂 你的特别\n[02:42.66]你的心有一道墙 但我发现一扇窗\n[02:51.81]偶尔透出 一丝暖暖的微光\n[02:58.78]就算你有一道墙 我的爱会攀上窗台盛放\n[03:06.73]打开窗你会看到 悲伤融化\n[03:14.22]你的心有一道墙 但我发现一扇窗\n[03:22.66]偶尔透出 一丝暖暖的微光\n[03:29.48]就算你有一道墙 我的爱会攀上窗台盛放\n[03:38.08]打开窗你会看到 悲伤融化\n[03:46.07]你会闻到幸福晴朗 的芬芳\n"
    }
}
const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}